ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_dcsm_common_regs.xml
<module id="DCSM_COMMON_REGS" HW_revision="" description="DCSM COMMON Registers">
	<register id="FLSEM" width="32" page="1" offset="0x0" internal="0" description="Flash Wrapper Semaphore Register">
		<bitfield id="SEM" description="Flash Semaphore Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Semaphore Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="SECTSTAT1" width="32" page="1" offset="0x8" internal="0" description="Flash Sectors Status Register 1">
		<bitfield id="STATUS_B0_SECT0" description="Zone Status Flash Bank0 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT1" description="Zone Status Flash Bank0 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT2" description="Zone Status Flash Bank0 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT3" description="Zone Status Flash Bank0 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT31_4" description="Zone Status Flash Bank0 Sector 31-4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT63_32" description="Zone Status Flash Bank0 Sector 63-32" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT95_64" description="Zone Status Flash Bank0 Sector 95-64" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B0_SECT127_96" description="Zone Status Flash Bank0 Sector 127-96" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT0" description="Zone Status Flash Bank1 Sector 0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT1" description="Zone Status Flash Bank1 Sector 1" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT2" description="Zone Status Flash Bank1 Sector 2" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT3" description="Zone Status Flash Bank1 Sector 3" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT31_4" description="Zone Status Flash Bank1 Sector 31-4" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT63_32" description="Zone Status Flash Bank1 Sector 63-32" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT95_64" description="Zone Status Flash Bank1 Sector 95-64" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B1_SECT127_96" description="Zone Status Flash Bank1 Sector 127-96" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="SECTSTAT2" width="32" page="1" offset="0xa" internal="0" description="Flash Sectors Status Register 2">
		<bitfield id="STATUS_B2_SECT0" description="Zone Status Flash Bank2 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT1" description="Zone Status Flash Bank2 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT2" description="Zone Status Flash Bank2 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT3" description="Zone Status Flash Bank2 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT31_4" description="Zone Status Flash Bank2 Sector 31-4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT63_32" description="Zone Status Flash Bank2 Sector 63-32" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT95_64" description="Zone Status Flash Bank2 Sector 95-64" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B2_SECT127_96" description="Zone Status Flash Bank2 Sector 127-96" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT0" description="Zone Status Flash Bank3 Sector 0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT1" description="Zone Status Flash Bank3 Sector 1" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT2" description="Zone Status Flash Bank3 Sector 2" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT3" description="Zone Status Flash Bank3 Sector 3" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT31_4" description="Zone Status Flash Bank3 Sector 31-4" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT63_32" description="Zone Status Flash Bank3 Sector 63-32" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT95_64" description="Zone Status Flash Bank3 Sector 95-64" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B3_SECT127_96" description="Zone Status Flash Bank3 Sector 127-96" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="SECTSTAT3" width="32" page="1" offset="0xc" internal="0" description="Flash Sectors Status Register 3">
		<bitfield id="STATUS_B4_SECT0" description="Zone Status Flash Bank4 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B4_SECT1" description="Zone Status Flash Bank4 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B4_SECT2" description="Zone Status Flash Bank4 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B4_SECT3" description="Zone Status Flash Bank4 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_B4_SECT31_4" description="Zone Status Flash Bank4 Sector 31-4" begin="9" end="8" width="2" rwaccess="R"/>
	</register>
	<register id="RAMSTAT1" width="32" page="1" offset="0x10" internal="0" description="RAM Status Register 1">
		<bitfield id="STATUS_RAM0" description="Zone Status RAM LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM1" description="Zone Status RAM LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM2" description="Zone Status RAM LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM3" description="Zone Status RAM LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM4" description="Zone Status RAM LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM5" description="Zone Status RAM LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM6" description="Zone Status RAM LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM7" description="Zone Status RAM LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM8" description="Zone Status RAM LS8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM9" description="Zone Status RAM LS9" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="SECERRSTAT" width="32" page="1" offset="0x18" internal="0" description="Security Error Status Register">
		<bitfield id="ERR" description="Security Configuration load Error Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="SECERRCLR" width="32" page="1" offset="0x1a" internal="0" description="Security Error Clear Register">
		<bitfield id="ERR" description="Clear Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SECERRFRC" width="32" page="1" offset="0x1c" internal="0" description="Security Error Force Register">
		<bitfield id="ERR" description="Set Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Valid Register Write Key" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="DENYCODE" width="32" page="1" offset="0x1e" internal="0" description="Flash Authorization Denial Code">
		<bitfield id="BLOCKED" description="Blocked Code" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ILLADDR" description="Illegal Address Code" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ILLPROG" description="Illegal Program Address" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ILLERASE" description="Illegal Erase Address" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ILLRDVER" description="Illegal Read Verify Address" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ILLMODECH" description="Illegal Mode Change" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ILLCMD" description="Illegal Command" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ILLSIZE" description="Illegal Command Size" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="UID_UNIQUE_31_0" width="32" page="1" offset="0x28" internal="0" description="Unique Identification Number Low">
		<bitfield id="UID_L" description="Unique Identification Number Low" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="UID_UNIQUE_63_32" width="32" page="1" offset="0x2a" internal="0" description="Unique Identification Number High">
		<bitfield id="UID_H" description="Unique Identification Number High" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PARTIDH" width="32" page="1" offset="0x2c" internal="0" description="Part Identification High Register">
		<bitfield id="ID" description="High Part Identification Number" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PERSEM1" width="32" page="1" offset="0x2e" internal="0" description="Peripheral Semaphore Register">
		<bitfield id="GRABWD" description="Grab Watchdog module" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GRABNMIWD" description="GRAB NMIWD module" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GRABTIMER1" description="Grab TIMER1 module" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GRABCLKCTL" description="Grab Clock Configuration" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GRABRSTCTL" description="Grab Reset Configuration" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Semaphore Key" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
</module>
